{
    "video_id": "y-4CG-ptHq4",
    "chunks": [
        {
            "chunk_id": 1,
            "content": "[Music] Hi everyone and welcome to the 100 steps campus tour. [Music] [Music] We'll start off from the outside of the building. You probably are not going to spend too much of your time here, but you have a garden and a place to sit and code for if you want to. Um, we'll set up some chairs here eventually, but this is a place where you can spend time. Usually, it's fun when it's raining. Um, but other than that, it's a fairly boring place. Um, but if you want, you can spend your time here. This is all the outside of the building. So, you know, reel it in. Uh, this is all that you get if you come to the 100x campus. When it comes to the outside of the building, let's go inside. [Music] Welcome inside the building. Um on the right side you have a reception area/ admissions area slash this will get converted to a co-working eventually but I be clear if you enter this is where you'll find the counselor in case you have more questions. Um that's right behind me and right behind you is the very first classroom. So if you go back here, I'm assuming there's a class going on right now, but that's the first classroom for the school students. Uh this is what it looks like. So that's the very first classroom. It has a capacity of around 150. Um and this is where you'll be learning/ spending most of your time honestly during classes. That's around 11 to 7 is when you'll be here and you know learning with I don't know 1 2 3 I see four five teachers right now. Uh you'll meet the faculty soon enough. That's Rouser. He teaches DSA. That's Rahul who does dev. That's Sukcham behind you also does dev. We have too many dev people. Not enough DSA people. And we have some I don't know something over here. Probably some dev. Let's go outside. That's the way we entered. And we can exit from there from behind me. [Music] This is the central courtyard area. Uh we've covered it a little too much. So it gets a little uh dark over here right now. We'll add more lights. But that's all the folks that have been placed in the past. We just got these banners done. And later I realized people change companies. So Amrit's photo is there, but he leftc.com. He's working somewhere else now. So we'll have to keep changing these more often than not. Um but that is it. That's the central courtyard area that will eventually again convert into co-working. All the open spots that you see will be co-working where you can co-work from. Um that's classroom number one. This is the central courtyard area/ your co-working space. And if there's an event that will happen in here as well. With that, we move to the first floor. The super 30 floor where you'll find the super 30 class. You see upstairs. All right. First floor has the jazzier super 30 classroom. Um so if you come to the first floor and it's open for everyone. It's not like it's only open for super 30 people. You will find the smaller classroom. This can fit around 80 to 90 people. That will be the capacity for super 30 this year. Super 30 for those of you who don't know is our most actionable program. Um by actionable I mean um it's a place where people who haven't really gotten a job right now are most probably undergrads from 2024 to 2025 uh come to learn and you know get jobs in a very actionable way. We keep the bat size really small because we want the outcomes to be really I don't know like some 80% 90% in a span of 6 months which is really hard. That's also why it's really hard to get in. Um there are around 5% of the people who got selected this year. Um it'll probably go down further. Um but yeah that's this is where I'll be spending most of my time because I'll be leading over 30 classes. Um also spend time in the school but this is the biggest goal for me because 6 months is all we have to place these 100 people. Um so that's always a challenge compared to a 4-year program. That's classroom number two. Let's move on to the hostel rooms. Follow me. So we'll go back downstairs um to enter from the main hostel area. So the hostel for guys has a different entry. For girls, it's up here, but for guys, there's a separate entry. I'll take you there next um to the boys hostel. [Music] All right, welcome to the entry for the boys hostel. Follow me. So, we have a few types of hostel rooms. Let's start with the cheapest one. This one's like 10,000 rupees a month with food. It's like pretty cheap. We've tried our best to optimize prices very less. So that you know I mean you'll spend 10k anywhere I would assume in Noa if you want food plus accommodation. So that's what you'll get in these rooms but that also you know means these rooms aren't the best. So check them out. Sorry. All right we'll start off with the I would say the mid-tier rooms. They're four sharing. Um and some of them have windows some of them don't. So the price is fairly optimized. So the hostel starts at 1.2 lakhs a year. So 10,000 rupees a month with food. Um, and I'm assuming any place you stay in Nida, probably anywhere in the country, um, you have to spend that much on food and accommodation. Um, and this is what the first set of hostel rooms looks like. I think there's someone staying here already, if I'm not wrong. Let's do a hostel raid. Yeah, there you go. Let's do a hostel raid. One student is staying right now. He came a little early. Taking long. I don't know what he was doing there. Look, this is pretty effective. All right, this is what the first hostel room looks like. Uh, as I said, someone's already here. It's a four sharing hospital room. Uh, and the AC is damn good. Like, I did not expect to be this good. Uh, this is what the room looks like. Um, it has it'll accommodate four people. We'll put up a table or chair or something else over there, but this is pretty much it. We have four beds, a cupboard, probably another cupboard, and a bunch of tables. If you want to see an empty one, um it's you just follow me. All of these are four sharing rooms. The ones on the left are good ones because they have windows. Um the ones on the right do not have windows. Like some of them do, some of them don't. This is another decent one to look at. Let me turn on the lights, which I have no idea where it happens from. Oh, there you go. So, that's the that's another idea of what the hospital room would look like. Two beds over here, two beds over here, one cupboard over here. Probably put a table over there, and that's it. You have the AC that makes it liveable honestly. Otherwise, it's like not as really hot. You see the mid-tier rooms. Let's take you to a slightly better room, slightly bigger. In case you feel like this isn't comfortable for you, we have something better right behind you. Follow me. These are the expensive rooms. Um, this one's also four sharing. We're still debating if this should be six sharing and seat or four sharing or expensive. Uh, but yeah, this will I think there's more than enough space here for four people. That's the other one you can get. Uh that's you've seen the mid-tier rooms, the slightly better rooms. There's a best tier room as well. Uh it's mostly available like I think we have four in boys and two in girls. Let's go to the girls host next and see how they're separated from the boys host. They have a separate entry and where the girls would be staying completely isolated from the rest of the campus. Follow me. We have to go back. [Music] This is a separate entry for girls. Now this staircase is only accessible to the girls. And if you go up from here, you reach the girls hostel. So all of this area that's five rooms is the complete girls hostel. U it'll be completely isolated from the rest of the building. Separate entry over here. And if you come behind me, I can show you one of the better rooms. One washroom. I mean, I haven't shown the washrooms, but they're they're like what you would expect. And this is one of the better rooms, I would say, because it has two windows facing in the front. Um, so that's what a room would look like for the girls. Um, need to clean this up a bit. Um, but yeah, that's what a girls host room looks like. We have five of these, four each. So, we have a capacity of 20 girls this year. I think we have 12. So, we're closer to capacity on that. uh for this year. Slightly complicated building, but this is a third stairwell which is a little bigger and you know takes you to the roof. Um this one if you come with me opens up directly to another sort of a classroom. I don't know if it is a classroom or what you would call it. Um we like to call it the auditorium. It has a capacity of around 150. Seats are not yet installed so do not judge me but this is what the auditorium looks like. It's in the same building on the second and the third floor. Um this is like two floors that's combined into one single auditorium. Um and that's where I don't know what will happen here. Probably if you guys like having classes here, we can have classes here for the school or for super 30. But mostly it'll be used for events. Um or if you guys want to watch movies um I think Big Shot and the social network are great movies to induct someone into computer science. So that's probably what the orientation is going to be like. Also, school isn't built alone. I won't be the only one here. You'll have a bunch of teachers, batch assess managers, TAs who will make sure you have a wholesome experience. We'll have Duv who will be leading data structures and algorithms. Rahul, Deepain and Yash will be helping me with dev as batches managers and teachers. The goal is you have a wholesome experience when you join Danex school admissions open for the 25 cohort. You also have a mess at the ground floor. So your breakfast, lunch and dinner will all be served over here. You just have to come down from your hostel room downstairs for breakfast. Go to your classroom, come back for lunch, go to your classroom, come back for dinner and back to your hostel room on the first, second or the third floor. Classroom is right over here. You can come over here, eat your food and go back to the classroom. Everything is kept in a single place to keep things as convenient as possible. And there's a canteen right over here if you want to buy something else. There's also a gym on the second floor with your washrooms right behind you. So, it's as convenient as possible. There'll be girls and boys and teachers timing over here. And you'll be given some points if you're hitting the gym regular. Hi everyone and"
        },
        {
            "chunk_id": 2,
            "content": "welcome to the 100 steps campus tour. You know your heart to [Music] Oh sh [Music] [Applause] [Music] The heart. [Music] [Applause] [Music]"
        }
    ]
}